<?// Basket Total ?>
<?php
global $page;
if ($page === 'Корзина') {
    $basketTitle = 'Ваша корзина:';
} else if ($page === 'Оформление заказа') {
    $basketTitle = 'Ваш заказ:';
} else {
    $basketTitle = 'Ваша корзина:';
}
?>
<div class="basket">
    <div class="basket-total">
        <div class="basket-total__title">
            <?=$basketTitle;?>
        </div>
        <div class="basket-total__results">
            <div class="basket-total__result skeleton">
                <span>
                    <span data-el="items-counter" data-type="with-word">0 товаров</span>:
                </span>
                <span>
                    <span data-el="total-sum-without-discount">0</span> ₽
                </span>
            </div>
            <span class="divider"></span>

            <div class="basket-total__result basket-total__result--discount skeleton">
                <span>Скидка:</span>
                <span>
                    <span data-el="total-discount">0</span> ₽
                </span>
            </div>
            <span class="divider"></span>

            <div class="basket-total__result basket-total__result--summary skeleton">
                <span>Итого:</span>
                <span>
                    <span data-el="total-sum">0</span> ₽
                </span>
            </div>
            <span class="divider"></span>
        </div>
        <?if ($page === 'Корзина') { ?>
            <a href="/order/" class="btn btn--accent btn--high w-100" data-el="to-order-btn">
                <span>К оформлению</span>
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M5.00023 10.9999L16.5862 10.9999L11.2932 5.70696C10.9027 5.31643 10.9027 4.68342 11.2932 4.29289C11.6837
                    3.90237 12.3167 3.90237 12.7073 4.29289L19.7073 11.2929L19.7756 11.3691C20.096 11.7618 20.0734 12.3408 19.7073
                    12.707L12.7073 19.707C12.3167 20.0975 11.6837 20.0975 11.2932 19.707C10.9027 19.3164 10.9027 18.6834 11.2932
                    18.2929L16.5862 12.9999L5.00023 12.9999C4.44795 12.9999 4.00023 12.5522 4.00023 11.9999C4.00023 11.4476 4.44795
                    10.9999 5.00023 10.9999Z" fill="white"/>
                </svg>
            </a>
        <? } else { ?>
            <button  class="btn btn--accent btn--high w-100" type="submit" form="order-form">
                <span>Оформить заказ</span>
            </button>
        <? } ?>
    </div>

    <div class="accordion">
        <div class="accordion-header" data-el-type="accordion">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M19 7.79981C19 6.94342 18.9997 6.36117 18.9629 5.91113C18.9271 5.47272 18.8619 5.2482 18.7822 5.0918C18.5905
                4.71555 18.2845 4.40951 17.9082 4.21778C17.7518 4.13809 17.5273 4.07293 17.0889 4.03711C16.6388 4.00035 16.0566 4
                15.2002 4H8.79981C7.94342 4 7.36117 4.00035 6.91113 4.03711C6.47272 4.07293 6.2482 4.13809 6.0918 4.21778C5.71555
                4.40951 5.40951 4.71555 5.21778 5.0918C5.13809 5.2482 5.07293 5.47272 5.03711 5.91113C5.00035 6.36117 5 6.94342 5
                7.79981V19.0361L6.16211 18.1914L6.30371 18.1045C6.64774 17.9329 7.06708 17.9724 7.375 18.2188L9.2793 19.7422L11.4121
                18.1914L11.5488 18.1074C11.8794 17.9402 12.2811 17.9684 12.5879 18.1914L14.7197 19.7422L16.625 18.2188C16.9768 17.9373
                 17.4735 17.9265 17.8379 18.1914L19 19.0361V7.79981ZM14.793 7.29297C15.1835 6.90245 15.8165 6.90245 16.207 7.29297C16.5976
                  7.6835 16.5976 8.31651 16.207 8.70703L11.707 13.207C11.3165 13.5976 10.6835 13.5976 10.293 13.207L8.29297 11.207C7.90245
                  10.8165 7.90245 10.1835 8.29297 9.79297C8.6835 9.40245 9.31651 9.40245 9.70703 9.79297L11 11.0859L14.793 7.29297ZM21 21C21
                   21.3761 20.7892 21.7209 20.4541 21.8916C20.119 22.0623 19.7163 22.0297 19.4121 21.8086L17.2793 20.2568L15.375 21.7813C15.0232
                    22.0627 14.5265 22.0735 14.1621 21.8086L12 20.2354L9.83789 21.8086C9.47351 22.0735 8.97681 22.0627 8.625 21.7813L6.71973
                    20.2568L4.58789 21.8086C4.28372 22.0297 3.88103 22.0623 3.5459 21.8916C3.21076 21.7209 3 21.3761 3 21V7.79981C3 6.97632
                     2.99898 6.29843 3.04395 5.74805C3.08988 5.18599 3.18827 4.6689 3.43555 4.1836C3.81902 3.43109 4.43109 2.81902 5.1836
                      2.43555C5.6689 2.18827 6.18599 2.08988 6.74805 2.04395C7.29843 1.99898 7.97632 2 8.79981 2H15.2002C16.0237 2 16.7016
                      1.99898 17.252 2.04395C17.814 2.08988 18.3311 2.18827 18.8164 2.43555C19.5689 2.81902 20.181 3.43109 20.5645 4.1836C20.8117
                      4.6689 20.9101 5.18599 20.9561 5.74805C21.001 6.29843 21 6.97632 21 7.79981V21Z" />
            </svg>
            <h4>Промокод</h4>
            <svg class="accordion-arrow" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M15.2929 13.707C15.6834 14.0976 16.3164 14.0976 16.707 13.707C17.0975 13.3165 17.0975 12.6835 16.707 12.293L12.707
                 8.29298C12.3164 7.90246 11.6834 7.90246 11.2929 8.29298L7.29289 12.293C6.90237 12.6835 6.90237 13.3165 7.29289 13.707C7.68342
                 14.0976 8.31643 14.0976 8.70696 13.707L11.9999 10.4141L15.2929 13.707Z" />
            </svg>
        </div>
        <div class="accordion-body">
            <div class="accordion-body-wrapper">
                <div class="accordion-body-text">
                    <div class="basket-promocodes">
                        <label class="custom-label">
                            <span class="custom-label-inner">
                                <span>Промокод</span>
                                <span class="custom-el-wrapper">
                                    <input type="text" class="custom-el custom-input" name="custom-input" placeholder="Введите промокод">
                                    <svg class="custom-input-icon" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M18.2929 4.29289C18.6834 3.90263 19.3165 3.90246 19.707 4.29289C20.0974 4.68333 20.0972 5.31641 19.707 5.70695L13.414
                                         11.9999L19.707 18.2929C20.0973 18.6834 20.0974 19.3165 19.707 19.707C19.3165 20.0973 18.6834 20.0973 18.2929 19.707L11.9999
                                          13.414L5.70695 19.707C5.31642 20.0973 4.68337 20.0974 4.29289 19.707C3.90256 19.3165 3.90255 18.6834 4.29289 18.2929L10.5859
                                           11.9999L4.29289 5.70695C3.90237 5.31643 3.90237 4.68342 4.29289 4.29289C4.68341 3.90237 5.31643 3.90237 5.70695
                                           4.29289L11.9999 10.5859L18.2929 4.29289Z" fill="#CCCCCC"/>
                                    </svg>
                                </span>
                            </span>
                        </label>
                        <button type="button" class="btn btn--black btn--high w-100 mt-12">
                            <span>Применить</span>
                        </button>
                    </div>
                </div>
            </div>
        </div>
    </div>

</div>